// const এর ভিতর কিছু লিখলে তা পরবর্তীতে এর ভ্যালু চেইঞ্জ করা যায় নাহ। আবার একই ভ্যারিয়েবল নাম বারবার ডিক্লিয়ার করা যায় নাহ যদি দেই তাহলে এরর দিবে।
const name = "Solaiman Khan";

// let এর ভ্যালু রি-এস্যাইন করা যায় মানে এর ভ্যালু চেইঞ্জ করা যায় তবে const এর মত এর ভ্যারিয়েবল নাম বারবার ডিক্লিয়ার করা যায় নাহ।
let season = "Rainy";
season = "Winter";
console.log(season);

// var আমরা মূলত ব্যবহার করবো নাহ এটা একের অধিক সেইম ভ্যারিয়েবল ডিক্লিয়ার করা যায়। তাছাড়া এটা গ্লোবাল স্কোপ বা লোকাল স্কোপ থেয়ে এক্সেস পাওয়া যায় যা ফাংশন ডিক্লিয়ারেশনের সময় প্রবলেম হবে।
var num = 15;
var num = 20;
console.log(num)